<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d5ca3411b252296851bf70e4a1dc86daf5acc917cd08cbbee76e2900f132e706","plan_job_ref":"Job PR on main #14 at https://github.com/softkitit/aws-landing-zone/actions/runs/7866526771","plan_out_hash":"a40e2c205eff684d449e8eb35f41428d9ed10de1403b4e52745555f1613eac18","plan_hash":"cdaca4a86f7ed45a9c7f06f284323eb03781f400cd6fd45c69e1708ed5736c2b","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan in __.__
With backend config files: `backends/global.s3.tfbackend`
With var files: `vars/global.tfvars
`
<details>
<summary>Plan: 61 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.admin_account_assignments.data.aws_identitystore_group.this["Global Admins"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_identitystore_group" "this" {
+       description       = (known after apply)
+       display_name      = (known after apply)
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"

+       alternate_identifier {
+           unique_attribute {
+               attribute_path  = "DisplayName"
+               attribute_value = "Global Admins"
            }
        }
    }

  # module.admin_account_assignments.aws_ssoadmin_account_assignment.this[0] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.admin_account_assignments.aws_ssoadmin_account_assignment.this[1] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.admin_account_assignments.aws_ssoadmin_account_assignment.this[2] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.admin_account_assignments.aws_ssoadmin_account_assignment.this[3] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.admin_account_assignments.aws_ssoadmin_account_assignment.this[4] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.admin_account_assignments.aws_ssoadmin_account_assignment.this[5] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.admin_account_assignments.null_resource.dependency will be created
+   resource "null_resource" "dependency" {
+       id       = (known after apply)
+       triggers = {
+           "dependency_id" = ""
        }
    }

  # module.billing_team_account_assignments.data.aws_identitystore_group.this["Finance"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_identitystore_group" "this" {
+       description       = (known after apply)
+       display_name      = (known after apply)
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"

+       alternate_identifier {
+           unique_attribute {
+               attribute_path  = "DisplayName"
+               attribute_value = "Finance"
            }
        }
    }

  # module.billing_team_account_assignments.data.aws_identitystore_group.this["Global Admins"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_identitystore_group" "this" {
+       description       = (known after apply)
+       display_name      = (known after apply)
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"

+       alternate_identifier {
+           unique_attribute {
+               attribute_path  = "DisplayName"
+               attribute_value = "Global Admins"
            }
        }
    }

  # module.billing_team_account_assignments.aws_ssoadmin_account_assignment.this[0] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.billing_team_account_assignments.aws_ssoadmin_account_assignment.this[1] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.billing_team_account_assignments.null_resource.dependency will be created
+   resource "null_resource" "dependency" {
+       id       = (known after apply)
+       triggers = {
+           "dependency_id" = ""
        }
    }

  # module.developer_full_account_assignments.data.aws_identitystore_group.this["Team Leads"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_identitystore_group" "this" {
+       description       = (known after apply)
+       display_name      = (known after apply)
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"

+       alternate_identifier {
+           unique_attribute {
+               attribute_path  = "DisplayName"
+               attribute_value = "Team Leads"
            }
        }
    }

  # module.developer_full_account_assignments.aws_ssoadmin_account_assignment.this[0] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.developer_full_account_assignments.aws_ssoadmin_account_assignment.this[1] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.developer_full_account_assignments.aws_ssoadmin_account_assignment.this[2] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.developer_full_account_assignments.null_resource.dependency will be created
+   resource "null_resource" "dependency" {
+       id       = (known after apply)
+       triggers = {
+           "dependency_id" = ""
        }
    }

  # module.developer_readonly_account_assignments.data.aws_identitystore_group.this["Developers"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_identitystore_group" "this" {
+       description       = (known after apply)
+       display_name      = (known after apply)
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"

+       alternate_identifier {
+           unique_attribute {
+               attribute_path  = "DisplayName"
+               attribute_value = "Developers"
            }
        }
    }

  # module.developer_readonly_account_assignments.aws_ssoadmin_account_assignment.this[0] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.developer_readonly_account_assignments.aws_ssoadmin_account_assignment.this[1] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.developer_readonly_account_assignments.aws_ssoadmin_account_assignment.this[2] will be created
+   resource "aws_ssoadmin_account_assignment" "this" {
+       id                 = (known after apply)
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
+       principal_id       = (known after apply)
+       principal_type     = "GROUP"
+       target_id          = (known after apply)
+       target_type        = "AWS_ACCOUNT"
    }

  # module.developer_readonly_account_assignments.null_resource.dependency will be created
+   resource "null_resource" "dependency" {
+       id       = (known after apply)
+       triggers = {
+           "dependency_id" = ""
        }
    }

  # module.organisation.aws_organizations_account.account["billing"] will be created
+   resource "aws_organizations_account" "account" {
+       arn                        = (known after apply)
+       close_on_deletion          = false
+       create_govcloud            = false
+       email                      = "vsamofal+billing@softkitit.com"
+       govcloud_id                = (known after apply)
+       iam_user_access_to_billing = "ALLOW"
+       id                         = (known after apply)
+       joined_method              = (known after apply)
+       joined_timestamp           = (known after apply)
+       name                       = "Billing"
+       parent_id                  = (known after apply)
+       status                     = (known after apply)
+       tags_all                   = (known after apply)
    }

  # module.organisation.aws_organizations_account.account["dev"] will be created
+   resource "aws_organizations_account" "account" {
+       arn                        = (known after apply)
+       close_on_deletion          = false
+       create_govcloud            = false
+       email                      = "vsamofal+dev@softkitit.com"
+       govcloud_id                = (known after apply)
+       iam_user_access_to_billing = "DENY"
+       id                         = (known after apply)
+       joined_method              = (known after apply)
+       joined_timestamp           = (known after apply)
+       name                       = "development"
+       parent_id                  = (known after apply)
+       status                     = (known after apply)
+       tags_all                   = (known after apply)
    }

  # module.organisation.aws_organizations_account.account["prod"] will be created
+   resource "aws_organizations_account" "account" {
+       arn                        = (known after apply)
+       close_on_deletion          = false
+       create_govcloud            = false
+       email                      = "vsamofal+prod@softkitit.com"
+       govcloud_id                = (known after apply)
+       iam_user_access_to_billing = "DENY"
+       id                         = (known after apply)
+       joined_method              = (known after apply)
+       joined_timestamp           = (known after apply)
+       name                       = "production"
+       parent_id                  = (known after apply)
+       status                     = (known after apply)
+       tags_all                   = (known after apply)
    }

  # module.organisation.aws_organizations_account.account["softkit"] will be created
+   resource "aws_organizations_account" "account" {
+       arn                        = (known after apply)
+       close_on_deletion          = false
+       create_govcloud            = false
+       email                      = "vsamofal@softkitit.com"
+       govcloud_id                = (known after apply)
+       iam_user_access_to_billing = "DENY"
+       id                         = (known after apply)
+       joined_method              = (known after apply)
+       joined_timestamp           = (known after apply)
+       name                       = "softkit"
+       parent_id                  = (known after apply)
+       status                     = (known after apply)
+       tags_all                   = (known after apply)
    }

  # module.organisation.aws_organizations_account.account["stg"] will be created
+   resource "aws_organizations_account" "account" {
+       arn                        = (known after apply)
+       close_on_deletion          = false
+       create_govcloud            = false
+       email                      = "vsamofal+stg@softkitit.com"
+       govcloud_id                = (known after apply)
+       iam_user_access_to_billing = "DENY"
+       id                         = (known after apply)
+       joined_method              = (known after apply)
+       joined_timestamp           = (known after apply)
+       name                       = "staging"
+       parent_id                  = (known after apply)
+       status                     = (known after apply)
+       tags_all                   = (known after apply)
    }

  # module.organisation.aws_organizations_account.account["vs-experiments"] will be created
+   resource "aws_organizations_account" "account" {
+       arn                        = (known after apply)
+       close_on_deletion          = false
+       create_govcloud            = false
+       email                      = "vsamofal+experiments@softkitit.com"
+       govcloud_id                = (known after apply)
+       iam_user_access_to_billing = "DENY"
+       id                         = (known after apply)
+       joined_method              = (known after apply)
+       joined_timestamp           = (known after apply)
+       name                       = "Vitalii Experiments"
+       parent_id                  = (known after apply)
+       status                     = (known after apply)
+       tags_all                   = (known after apply)
    }

  # module.organisation.aws_organizations_organization.organization will be created
+   resource "aws_organizations_organization" "organization" {
+       accounts                      = (known after apply)
+       arn                           = (known after apply)
+       aws_service_access_principals = [
+           "cloudtrail.amazonaws.com",
+           "config.amazonaws.com",
+           "sso.amazonaws.com",
        ]
+       feature_set                   = "ALL"
+       id                            = (known after apply)
+       master_account_arn            = (known after apply)
+       master_account_email          = (known after apply)
+       master_account_id             = (known after apply)
+       non_master_accounts           = (known after apply)
+       roots                         = (known after apply)
    }

  # module.organisation.aws_organizations_organizational_unit.level_1_ous["experiments"] will be created
+   resource "aws_organizations_organizational_unit" "level_1_ous" {
+       accounts  = (known after apply)
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "Experiments"
+       parent_id = (known after apply)
+       tags_all  = (known after apply)
    }

  # module.organisation.aws_organizations_organizational_unit.level_1_ous["finance"] will be created
+   resource "aws_organizations_organizational_unit" "level_1_ous" {
+       accounts  = (known after apply)
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "Finance"
+       parent_id = (known after apply)
+       tags_all  = (known after apply)
    }

  # module.organisation.aws_organizations_organizational_unit.level_1_ous["suspended"] will be created
+   resource "aws_organizations_organizational_unit" "level_1_ous" {
+       accounts  = (known after apply)
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "Suspended"
+       parent_id = (known after apply)
+       tags_all  = (known after apply)
    }

  # module.organisation.aws_organizations_organizational_unit.level_1_ous["workloads"] will be created
+   resource "aws_organizations_organizational_unit" "level_1_ous" {
+       accounts  = (known after apply)
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "Workloads"
+       parent_id = (known after apply)
+       tags_all  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["AdministratorAccess.arn:aws:iam::aws:policy/AdministratorAccess"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/AdministratorAccess"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["BillingAccess.arn:aws:iam::aws:policy/job-function/Billing"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/job-function/Billing"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["DeveloperFullAccess.arn:aws:iam::aws:policy/PowerUserAccess"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/PowerUserAccess"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["DeveloperReadOnlyAccess.arn:aws:iam::aws:policy/AWSElasticBeanstalkReadOnly"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/AWSElasticBeanstalkReadOnly"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["DeveloperReadOnlyAccess.arn:aws:iam::aws:policy/AmazonCognitoReadOnly"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/AmazonCognitoReadOnly"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["DeveloperReadOnlyAccess.arn:aws:iam::aws:policy/AmazonSQSReadOnlyAccess"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/AmazonSQSReadOnlyAccess"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["DeveloperReadOnlyAccess.arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_managed_policy_attachment.this["DeveloperReadOnlyAccess.arn:aws:iam::aws:policy/ReadOnlyAccess"] will be created
+   resource "aws_ssoadmin_managed_policy_attachment" "this" {
+       id                  = (known after apply)
+       instance_arn        = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       managed_policy_arn  = "arn:aws:iam::aws:policy/ReadOnlyAccess"
+       managed_policy_name = (known after apply)
+       permission_set_arn  = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_permission_set.this["AdministratorAccess"] will be created
+   resource "aws_ssoadmin_permission_set" "this" {
+       arn              = (known after apply)
+       created_date     = (known after apply)
+       description      = "Allow Full Access to the account"
+       id               = (known after apply)
+       instance_arn     = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       name             = "AdministratorAccess"
+       session_duration = "PT1H"
+       tags             = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
+       tags_all         = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
    }

  # module.permission_sets.aws_ssoadmin_permission_set.this["BillingAccess"] will be created
+   resource "aws_ssoadmin_permission_set" "this" {
+       arn              = (known after apply)
+       created_date     = (known after apply)
+       description      = "Allow Full Access to the billing information"
+       id               = (known after apply)
+       instance_arn     = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       name             = "BillingAccess"
+       session_duration = "PT1H"
+       tags             = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
+       tags_all         = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
    }

  # module.permission_sets.aws_ssoadmin_permission_set.this["DeveloperFullAccess"] will be created
+   resource "aws_ssoadmin_permission_set" "this" {
+       arn              = (known after apply)
+       created_date     = (known after apply)
+       description      = "Full access for developers, shouldn't be used by everyone on prod envs, only team leads and developers with confident should have access"
+       id               = (known after apply)
+       instance_arn     = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       name             = "DeveloperFullAccess"
+       session_duration = "PT12H"
+       tags             = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
+       tags_all         = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
    }

  # module.permission_sets.aws_ssoadmin_permission_set.this["DeveloperReadOnlyAccess"] will be created
+   resource "aws_ssoadmin_permission_set" "this" {
+       arn              = (known after apply)
+       created_date     = (known after apply)
+       description      = "Read only access for developers"
+       id               = (known after apply)
+       instance_arn     = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       name             = "DeveloperReadOnlyAccess"
+       session_duration = "PT12H"
+       tags             = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
+       tags_all         = {
+           "Name"       = "softkitit-aws-landing-zone"
+           "Namespace"  = "softkitit"
+           "Repository" = "aws-landing-zone"
        }
    }

  # module.permission_sets.aws_ssoadmin_permission_set_inline_policy.this["DeveloperFullAccess"] will be created
+   resource "aws_ssoadmin_permission_set_inline_policy" "this" {
+       id                 = (known after apply)
+       inline_policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:Accept*",
+                           "ec2:Allocate*",
+                           "ec2:Assign*",
+                           "ec2:Associate*",
+                           "ec2:Attach*",
+                           "ec2:Authorize*",
+                           "ec2:Cancel*",
+                           "ec2:Confirm*",
+                           "ec2:Copy*",
+                           "ec2:Create*",
+                           "ec2:Delete*",
+                           "ec2:Deprovision*",
+                           "ec2:Deregister*",
+                           "ec2:Detach*",
+                           "ec2:Disable*",
+                           "ec2:Disassociate*",
+                           "ec2:Enable*",
+                           "ec2:Modify*",
+                           "ec2:Purchase*",
+                           "ec2:Register*",
+                           "ec2:Reject*",
+                           "ec2:Replace*",
+                           "ec2:Revoke*",
+                           "ec2:Run*",
+                           "ec2:Terminate*",
+                           "ec2:Unassign*",
+                           "ec2:Update*",
                        ]
+                       Effect   = "Deny"
+                       Resource = "*"
+                       Sid      = "RestrictEC2permission"
                    },
+                   {
+                       Action   = [
+                           "iam:List*",
+                           "iam:Get*",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AddIAMpermission"
                    },
+                   {
+                       Action   = [
+                           "iam:Add*",
+                           "iam:Attach*",
+                           "iam:ChangePassword",
+                           "iam:Create*",
+                           "iam:DeactivateMFADevice",
+                           "iam:Delete*",
+                           "iam:DetachGroupPolicy",
+                           "iam:Detach*",
+                           "iam:EnableMFADevice",
+                           "iam:Put*",
+                           "iam:RemoveCl*",
+                           "iam:ResetServiceSpecificCredential",
+                           "iam:ResyncMFADevice",
+                           "iam:Set*",
+                           "iam:Update*",
+                           "iam:Upload*",
                        ]
+                       Effect   = "Deny"
+                       Resource = "*"
+                       Sid      = "RestrictIAMpermission"
                    },
+                   {
+                       Action   = [
+                           "es:ESHttpGet",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "ElasticSearch"
                    },
+                   {
+                       Action   = [
+                           "rds:Add*",
+                           "rds:AuthorizeDBSecurityGroupIngress",
+                           "rds:CreateDBInstance*",
+                           "rds:CreateGlobalCluster",
+                           "rds:CreateDBCluster*",
+                           "rds:CreateDBSubnetGroup",
+                           "rds:CreateDBProxyEndpoint",
+                           "rds:CreateDBSecurityGroup",
+                           "rds:CreateDBProxy",
+                           "rds:CreateTenantDatabase",
+                           "rds:Delete*",
+                           "rds:RevokeDBSecurityGroupIngress",
+                           "es:Create*",
+                           "es:Delete*",
+                           "es:Purchase*",
                        ]
+                       Effect   = "Deny"
+                       Resource = "*"
+                       Sid      = "RestrictRDSpermission"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
    }

  # module.permission_sets.aws_ssoadmin_permission_set_inline_policy.this["DeveloperReadOnlyAccess"] will be created
+   resource "aws_ssoadmin_permission_set_inline_policy" "this" {
+       id                 = (known after apply)
+       inline_policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "es:ESHttpGet",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "ElasticSearch"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       instance_arn       = "arn:aws:sso:::instance/ssoins-698785fda2ce0051"
+       permission_set_arn = (known after apply)
    }

  # module.terraform_state_backend.local_file.terraform_backend_config[0] will be created
+   resource "local_file" "terraform_backend_config" {
+       content              = <<-EOT
            terraform {
              required_version = ">= 1.0.0"
            
              backend "s3" {
                region  = "eu-central-1"
                bucket  = "global-softkitit-aws-landing-zone"
                key     = "global-terraform.tfstate"
                profile = ""
                encrypt = "true"
            
                dynamodb_table = "global-softkitit-aws-landing-zone"
              }
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./global-backend.tf"
+       id                   = (known after apply)
    }

  # module.user_management.aws_identitystore_group.this["admins"] will be created
+   resource "aws_identitystore_group" "this" {
+       description       = "Global Admins group, to manage everything"
+       display_name      = "Global Admins"
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
    }

  # module.user_management.aws_identitystore_group.this["developers"] will be created
+   resource "aws_identitystore_group" "this" {
+       description       = "Developers group"
+       display_name      = "Developers"
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
    }

  # module.user_management.aws_identitystore_group.this["devops"] will be created
+   resource "aws_identitystore_group" "this" {
+       description       = "DevOps group"
+       display_name      = "DevOps"
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
    }

  # module.user_management.aws_identitystore_group.this["finance"] will be created
+   resource "aws_identitystore_group" "this" {
+       description       = "Finance group, to manage finance related stuff, see reports, download invoices"
+       display_name      = "Finance"
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
    }

  # module.user_management.aws_identitystore_group.this["team_leads"] will be created
+   resource "aws_identitystore_group" "this" {
+       description       = "Team Leads group, usually have more access on production"
+       display_name      = "Team Leads"
+       external_ids      = (known after apply)
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
    }

  # module.user_management.aws_identitystore_group_membership.this["mzueva-finance"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["nk-developers"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["nk-devops"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["nk-team_leads"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["root-admin-admins"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["root-admin-developers"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["root-admin-devops"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["root-admin-finance"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_group_membership.this["root-admin-team_leads"] will be created
+   resource "aws_identitystore_group_membership" "this" {
+       group_id          = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       member_id         = (known after apply)
+       membership_id     = (known after apply)
    }

  # module.user_management.aws_identitystore_user.this["mzueva"] will be created
+   resource "aws_identitystore_user" "this" {
+       display_name      = "Maria Zueva"
+       external_ids      = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       user_id           = (known after apply)
+       user_name         = "mzueva"

+       emails {
+           primary = true
+           type    = "work"
+           value   = "mzueva@softkitit.com"
        }

+       name {
+           family_name = "Zueva"
+           given_name  = "Maria"
        }
    }

  # module.user_management.aws_identitystore_user.this["nk"] will be created
+   resource "aws_identitystore_user" "this" {
+       display_name      = "Nick Kolodnitsky"
+       external_ids      = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       user_id           = (known after apply)
+       user_name         = "nk"

+       emails {
+           primary = true
+           type    = "work"
+           value   = "nkolodnitsky@softkitit.com"
        }

+       name {
+           family_name = "Kolodnitsky"
+           given_name  = "Nick"
        }
    }

  # module.user_management.aws_identitystore_user.this["root-admin"] will be created
+   resource "aws_identitystore_user" "this" {
+       display_name      = "Vitalii Samofal"
+       external_ids      = (known after apply)
+       id                = (known after apply)
+       identity_store_id = "************"
+       user_id           = (known after apply)
+       user_name         = "root-admin"

+       emails {
+           primary = true
+           type    = "work"
+           value   = "vsamofal+root-admin@softkitit.com"
        }

+       name {
+           family_name = "Samofal"
+           given_name  = "Vitalii"
        }
    }

Plan: 61 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [PR on main #14](https://github.com/softkitit/aws-landing-zone/actions/runs/7866526771)